import StepItem from "./StepItem";

export default function StepsList() {
    const steps = [
        "Почистити картоплю всією компанією та відварити",
        "Зліпити котлети та обсмажити до чорноти",
        "А чому до чорноти? Давайте смажте знову, але цього разу не відволікайтесь!",
        "З картоплі зробити ніжне пюре з маслом.",
        "Сказати друзям поторопитися",
        "Нарізати огірки та кинути листочки",
        "Згадати якийсь анекдот, який друзі не викуплять, але все одно буде смішно",
        "Дочекатися друзів, та розпочинати"
    ];

    return (
        <div>
            <h3>Кроки приготування</h3>
            <ol>
                {steps.map((text, index) => (
                    <StepItem key={index} number={index + 1} text={text} />
                ))}
            </ol>
        </div>
    );
}
