import dali from '../assets/Dali.jpg'
import PageWrapper from '../components/PageWrapper'
import '../styles/Page.css'


export default function Biography() {
    return (
        <PageWrapper>
            <section className="page">
                <h1>Сальвадор Далі</h1>

                <img
                    src={dali}
                    alt="Salvador Dalí"
                    style={{ width: '300px', float: 'right', margin: '0 0 20px 20px' }}
                />

                <p>
                    <strong>Сальвадор Далі</strong> — іспанський художник-сюрреаліст,
                    один із найяскравіших митців ХХ століття.
                    Він відомий своїм неоднозначним характером,
                    глибокою символікою та образами, закладеними в свої картини, що іноді нагадують сни.
                    Хто знає, може саме зі своїх снів він черпав натхнення?
                </p>

                <p>
                    Народився у 1904 році в Фігерасі, Іспанія.
                    Ось народився, а далі почав експериментувати з підсвідомістю, часом, страхами
                    та ірраціональністю, створюючи картини,
                    які змушують глядача сумніватися у реальності навколо себе, та їноді відчувати
                    екзистанційну кризу.
                </p>

                <p>
                    Його творчість охоплює живопис, скульптуру,
                    дизайн та навіть кіно.
                </p>
            </section>
        </PageWrapper>
    )
}